sdaiDeleteModelBN(Sdai_instS*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte*)
\details
Deletes a specified model.
\param repository [in] A repository where the function searches for the model by its name.
\param modelName [in] A string that contains the name of the model to be deleted.